#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/give-back-cincinnati/gbc-infra/runs/run-ebVdDAWhaLbqfZwZ

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.gbc: Reading...
data.cloudflare_zones.gbc: Read complete after 0s [id=86d947abd1990f315eb415450516882e]
cloudflare_page_rule.www_redirect: Refreshing state... [id=82e0b98b0e7ba0a373f495bfea3d464f]
cloudflare_record.gbc_next: Refreshing state... [id=a5db23132cde2c5180bb31b3609bb469]
cloudflare_zone_settings_override.gbc_dev_settings: Refreshing state... [id=f746dcf37d3a9a454301a1744e99af3b]
azurerm_resource_group.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources]
azurerm_virtual_network.gbc_vnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.ContainerRegistry/registries/gbcCR]
azurerm_subnet.gbc_subnet: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/gbc-resources/providers/Microsoft.Network/virtualNetworks/gbc-vnet/subnets/gbc-subnet]
azurerm_kubernetes_cluster.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourcegroups/gbc-resources/providers/Microsoft.ContainerService/managedClusters/gbc-aks]
data.azurerm_resource_group.aks_resource_group: Reading...
data.azurerm_resource_group.aks_resource_group: Read complete after 0s [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus]
azurerm_public_ip.gbc: Refreshing state... [id=/subscriptions/79a8356d-6d94-4636-b285-cf83770ec961/resourceGroups/MC_gbc-resources_gbc-aks_eastus/providers/Microsoft.Network/publicIPAddresses/gbcPublicIp]
kubernetes_namespace.new_relic: Refreshing state... [id=new-relic]
kubernetes_namespace.stage: Refreshing state... [id=stage]
kubernetes_namespace.prod: Refreshing state... [id=prod]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_namespace.vault: Refreshing state... [id=vault]
kubernetes_namespace.ingress: Refreshing state... [id=ingress-nginx]
helm_release.redis: Refreshing state... [id=redis]
helm_release.mongodb: Refreshing state... [id=mongodb]
helm_release.vault: Refreshing state... [id=gbc]
helm_release.cert-manager: Refreshing state... [id=gbc]
cloudflare_record.gbc_api: Refreshing state... [id=10ffaed1b982a77ffb8a27224edda9da]
cloudflare_record.vault: Refreshing state... [id=61901e39fc7cb7999a271d4d732f8ecb]
helm_release.nginx_ingress: Refreshing state... [id=gbc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.cloudflare-bucket will be created
  + resource "aws_s3_bucket" "cloudflare-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "gbc-static"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
*Pushed by: @MYoung25, Action: `pull_request`*